//задание 1
//Задание 1 — Теоретические вопросы
//Что такое конструктор в C++?
//Это специальный метод класса, который автоматически вызывается при создании объекта для инициализации его.

//Когда вызывается конструктор объекта?
//При создании объекта класса — как на стеке, так и в динамической памяти.

//Что такое конструктор по умолчанию?
//Конструктор, который либо не принимает параметров, либо все параметры имеют значения по умолчанию.

//Можно ли создать несколько конструкторов в одном классе?
//Да, это называется перегрузкой конструкторов — несколько конструкторов с разными параметрами.

//Для чего используется деструктор?
//Для выполнения очистки перед уничтожением объекта (например, освобождение ресурсов).

co
